/* Имя оператора по умолчанию, если не подгрузилась информация */
"agent_name_default" = "Օպերատոր";

/* Надпись к сообщениям клиента */
"agent_name_you" = "Դուք";

"Agent.DisplayName.Deleted" = "Հեռացված օպերատոր";

/* Normally user iOS device doesn't return "Restricted" camera access status. But for test purposes we've added an alert with this string message anyway. */
"Camera.Access.Restricted" = "Տեսախցիկի մուտքն արգելված է";

"Camera.Access.Suggestion" = "Լուսանկարելու համար անհրաժեշտ է տեսախցիկի հասանելիություն թույլտվությունը";

/* Alert with this message displays when you try to take a photo from camera on iOS simulator or when real device experiencing some technical issues. */
"Camera.Access.Unavailable" = "Տեսախցիկը հասանելի չէ";

"chat_input.status.contact_info" = "Խնդրում ենք մուտքագրել ձեր կոնտակտները";

/* Подзаголовок окна чата по умолчанию */
"chat_subtitle_placeholder" = "Կապի մեջ 24/7!";

/* Системное сообщение в ленте чата, говорящее о том, что произошел разрыв соединения  с сервером. */
"chat_system_disconnected" = "Ցանցային խնդիր: %d, սխալի հաղորդագրություն: %s";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент несколько агентов набирают сообщение. */
"chat_system_few_agents_typing" = "%s, %s և %d մուտքագրում է հաղորդագրություն...";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент один агент набирает сообщение. */
"chat_system_one_agent_typing" = "%s մուտքագրում է հաղորդագրություն...";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент два агента набирают сообщение. */
"chat_system_two_agents_typing" = "%s and %s մուտքագրում են հաղորդագրություն...";

/* Заголовок окна чата по умолчанию */
"chat_title_placeholder" = "Օնլայն աջակցություն";

"chat.state_unavailable.discription" = "Օնլայն աջակցությունը այս պահին ժամանակավորապես անհասանելի է: Խնդրում եմ փորձեք մի փոքր ուշ.";

"chat.state_unavailable.title" = "Օնլայն աջակցությունը ժամանակավորապես անհասանելի է";

"chat.system.contact_form.introduce_in_chat" = "Խնդրում ենք ներկայանալ չաթում";

"chat.system.contact_form.must_fill" = "Խնդրում ենք մուտքագրել ձեր կոնտակտային տվյալները, որպեսզի մենք կարողանանք պատասխանել ձեզ";

"chat.system.contact_form.status_sent" = "Ձեր հաղորդագրությունն ուղարկվում է թիմին: Նրանք շուտով կապի մեջ կլինեն:";

"Chat.System.Media.Preparing" = "Ֆայլի պատրաստում...";

"Chat.System.Media.Uploading" = "Ֆայլի ուղարկում...";

"Chat.System.NewMessages" = "Նոր հաղորդագրություններ";

"Client.Title" = "Հաճախորդ #%d";

/* Общая строка "Отмена" */
"common_cancel" = "Չեղարկել";

"common_close" = "Փակել";

"common_done" = "Կատարված է";

"common_understand" = "Հասկացա!";

/* Универсальное сообщение о неизвестной ошибке. */
"common_unknown_error" = "Տեխնիկական սխալ";

"Common.Open" = "Բացել";

"common.send" = "Ուղարկել";

/* Состояние подключения к сервису */
"connection_state_connecting" = "Միացում…";

/* Состояние отсутствия подключения */
"connection_state_disconnected" = "Միացումը ձախողվեց, նորից փորձեք %d վայրկյանից";

/* Кнопка для повторного подключения к сервису, не дожидаясь таймаута  */
"connection_state_retry" = "Միանալ հիմա";

"contact_form.email.placeholder" = "Ձեր էլ.փոստը";

"contact_form.name.placeholder" = "Ձեր անունը";

"contact_form.phone.placeholder" = "Ձեր հեռախոսահամարը";

"contact_form.status.sent" = "Շնորհակալություն!";

/* Статус загрузки - ошибка */
"download_status_error" = "Սխալ";

/* Статус загрузки - загрузка */
"download_status_loading" = "Ներբեռնում...";

/* Ошибка загрузки файла, если ссылка устарела. */
"file_download_expired" = "Հղման ժամկետը սպառվել է";

/* Message letting user know that file is unavailable for download. */
"file_download_unavailable" = "Ֆայլը հասանելի չէ";

/* Проверка ссылки на файл */
"file_link_checking" = "Ստուգում...";

/* Default file name */
"file_name_unknown" = "անանուն ֆայլ";

"file_transfer_disabled" = "Ֆայլի փոխանցումն անջատված է";

/* Формат для размера файла в байтах */
"format_file_size_b" = "%.0f Բ";

/* Формат для размера файла в килобайтах */
"format_file_size_kb" = "%.0f ԿԲ";

/* Формат для размера файла в мегабайтах */
"format_file_size_mb" = "%.2f ՄԲ";

/* Подсказка в окне ввода сообщения */
"input_message_placeholder" = "Մուտքագրեք ձեր հաղորդագրությունը...";

"jivo_business_messenger" = "Բիզնես մեսենջեր";

/* Надпись на кнопке контекстного меню выбора типа вложения. Нажатие на кнопку открывает системный пикер документов. */
"media_upload_attachment_type_selecting_document" = "Փաստաթուղթ";

/* Надпись на кнопке контекстного меню выбора типа вложения. Нажатие на кнопку вызывает пикер фотогалереи. */
"media_upload_attachment_type_selecting_photo" = "Լուսանկար";

/* Заголовок с вопросом о том, какой тип вложения пользователь хочет прикрепить к сообщению. */
"media_upload_select_an_attachment_type_title" = "Ի՞նչ եք ցանկանում ուղարկել:";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент ведётся загрузка файла на сервер. */
"media_upload_sending_the_file" = "Ֆայլը ներբեռնվում է";

"media_uploading_common_error" = "Ֆայլի ներբեռնման սխալ";

/* Ошибка, возникающая при неудачной подготовке файла к загрузке. */
"media_uploading_extraction_error" = "Չհաջողվեց ներբեռնել ֆայլը";

/* Превышение лимита выгружаемого файла */
"media_uploading_too_large" = "Ֆայլի չափը չպետք է գերազանցի %dՄԲ";

"Media.Access.Missing" = "Թույլատրել մուտքը";

"Media.Access.Suggestion" = "Լուսանկարներ և տեսանյութեր ուղարկելու համար անհրաժեշտ է մուտքի թույլատրություն պատկերասրահ.\n\n Խնդրում ենք անցնել [Settings > Your App > Photos] և տալ թույլատրություն.";

"Media.Picker.Camera" = "Տեսախցիկ";

/* Пункт меню "Копировать ссылку" */
"menu_action_copy" = "Պատճենել հղումը";

/* Пункт меню "Cкачать" */
"menu_action_download" = "Բեռնել";

/* Кнопка скачать для прикрепленного документа/файла */
"message_download" = "Բեռնել";

/* Системное сообщение о присоединении оператора к чату */
"message_system_operator_accepted" = "Օպերատորը միացած երկխոսությանը";

/* Unsupported file type */
"message_unsupported_media" = "Այս ֆայլի տեսակ չի աջակցվում";

"Message.Deleted" = "հաղորդագրությունը ջնջվել է";

"Message.Edited" = "(փոփոխված է)";

"Message.Preview.Line" = "Զրույցը տեղափոխվեց երկրորդ գիծ";

"Message.Sender.You" = "Դուք";

"messages.label.bot" = "բոտ";

"notification_channel_message_description" = "Jivo SDK-ից հաղորդագրություն";

"notification_channel_message_name" = "Jivo";

/* Format for text message where $1 is agent name, $2 - text message */
"notification_message_text_format" = "%1$s: %2$s";

"notification_message_title" = "Աջակցություն";

"offline_message_placeholder" = "Ներկայումս օպերատորները անհասանելի են: Խնդրում ենք թողնել ձեր հաղորդագրությունը, և մենք կկապվենք ձեզ հետ:";

/* Пункт "Копировать" контекстного меню, вызываемого долгим тапом по бабблу сообщения. */
"options_copy" = "Պատճենահանել";

"options_delete" = "Delete";

/* Пункт "Повторить отправку" контекстного меню, вызываемого долгим тапом по бабблу сообщения. */
"options_resend" = "Կրկին ուղարկել";

/* Normally an alert with this message shouldn't be displayed but for test purposes it was added to SDK anyway., If there is an error then the alert should be displayed on photo library access try when starting to pick images. */
"PhotoLibrary.Access.NoAvailableImages" = "Հասանելի նկարներ չկան";

/* Normally an alert with this message shouldn't be displayed but for test purposes it was added to SDK anyway */
"PhotoLibrary.Access.Unavailable" = "Ֆոտադարանը անհասանելի է";

"rate_form.comment_title" = "Ձեր մեկնաբանությունը";

"rate_form.description" = "Որքանո՞վ եք բավարարված գործակալի պատասխաններից։";

"rate_form.finish_description_bad" = "Մենք ձգտում ենք լավագույն ծառայությունը մատուցել ձեզ: Մենք աշխատելու բան ունենք։";

"rate_form.finish_description_good" = "Մենք ուրախ ենք, որ այն ձեզ դուր եկավ";

"rate_form.finish_title" = "Շնորհակալություն ձեր արձագանքի համար:";

"rate_form.send" = "Ուղարկել";

"rate_form.title" = "Թողնել կարծիք";

"status_missing_connection" = "Կապ չկա";

"suggest_check_internet_access" = "Խնդրում ենք ստուգել ձեր ինտերնետ կապը";

"toast_copied_to_clipboard" = "Պատճենված է";

/* Unsupported message type bubble discription */
"unsupported_message_description" = "Հավելվածի տարբերակը հնացած է։ Մանրամասները հաղորդագրության մեջ. %s";

/* postfix */
"unsupported_message_postfix" = "մանրամասն \u0020";

/* Title for unsupported message bubble  */
"unsupported_message_title" = "Չաջակցվող հաղորդագրության տեսակ";

/* Приветственное сообщение для пустого чата */
"welcome_message_placeholder" = "Բջջային հավելվածի հետ ինչ-որ բան այն չէ՞, թե՞ պարզ չէ: Գրեք, մենք կաջակցենք։";

